aqafridi/Embedded-Systems-Engineering/Microprocessors and Embedded System Programming/PIC18 LABs/lab 6.X/lab 6.c
// PIC18F4550 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1L
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config USBDIV = 1       // USB Clock Selection bit (used in Full-Speed USB mode only; UCFG:FSEN = 1) (USB clock source comes directly from the primary oscillator block with no postscale)

// CONFIG1H
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator (HS))
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = OFF       // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config VREGEN = OFF     // USB Voltage Regulator Enable bit (USB voltage regulator disabled)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = ON      // PORTB A/D Enable bit (PORTB<4:0> pins are configured as analog input channels on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = ON         // Single-Supply ICSP Enable bit (Single-Supply ICSP enabled)
#pragma config ICPRT = OFF      // Dedicated In-Circuit Debug/Programming Port (ICPORT) Enable bit (ICPORT disabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection bit (Block 0 (000800-001FFFh) is not code-protected)
#pragma config CP1 = OFF        // Code Protection bit (Block 1 (002000-003FFFh) is not code-protected)
#pragma config CP2 = OFF        // Code Protection bit (Block 2 (004000-005FFFh) is not code-protected)
#pragma config CP3 = OFF        // Code Protection bit (Block 3 (006000-007FFFh) is not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot block (000000-0007FFh) is not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM is not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000800-001FFFh) is not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (002000-003FFFh) is not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (004000-005FFFh) is not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (006000-007FFFh) is not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) are not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot block (000000-0007FFh) is not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM is not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000800-001FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (002000-003FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (004000-005FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (006000-007FFFh) is not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot block (000000-0007FFh) is not protected from table reads executed in other blocks)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#include <xc.h>

unsigned char count = 0;
unsigned char value= 0;
unsigned char units = 0;
unsigned char tens = 0;
unsigned char hund = 0;

void __interrupt () ISR(void)
{
    if (ADIF == 1)
    {
        ADIF = 0;
        value = ADRESH;
        
        hund = value/100;
        hund = hund + 48;
        value = value%100;
        tens = value/10;
        tens = tens + 48;
        units = value%10;
        units = units + 48;
        
        TXIF = 0;
        TXREG = hund;
        while (TXIF ==0);
        
        TXIF = 0;
        TXREG = tens;
        while (TXIF ==0);
        
        TXIF = 0;
        TXREG = units;
        while (TXIF ==0); 
        
        TXIF = 0;
        TXREG = '\r';
        while (TXIF ==0);
        
        TXIF = 0;
        
        GODONE = 1;
    }
    
    if (TMR0IF == 1 )
    {
        count = TMR1L;
        count = count/5;            //delay 5 seconds. value to be known of 1 seconds
        
        hund = count/100;
        hund = hund + 48;
        count = count%100;
        tens = count/10;
        tens = tens + 48;
        units = count%10;
        units = units + 48;
        
        TXREG = '\r';
        while (TXIF ==0);
        TXIF = 0;
        
        TXREG = '\r';
        while (TXIF ==0);
        TXIF = 0;
        
        TXREG = hund;
        while (TXIF ==0);
        TXIF = 0;
        
        TXREG = tens;
        while (TXIF ==0);
        TXIF = 0;
        
        TXREG = units;
        while (TXIF ==0);
        TXIF = 0;
        
        TXREG = '\r';
        while (TXIF ==0);
        TXIF = 0;
        
        while (1);
    }
    
}


void main (void)
{
    TRISA0 = 1;
    
    ADCON0 = 0B00000001;
    ADCON1 = 0B00001101;
    ADCON2 = 0B00010010;
    
    T0CON = 0B00000110;
    T1CON = 0B10000010;
    TMR0 = 26474;
    TMR1 = 0; 
    
    GIE = 1; 
    PEIE = 1;
    TMR0IE = 1;
    ADIE = 1;
    
    SPEN = 1;
    TXEN = 1;
    SYNC = 0;
    BRGH = 1;
    CREN = 1;
    SPBRG = 25;
    TXIF = 0;
    
    TMR1ON = 1;
    TMR0ON = 1;
    
    GODONE = 1;
  
    while(1);
}

